{
    "intents": [
      {
        "tag": "ทักทาย",
        "patterns": [
          "สวัสดี",
          "หวัดดี",
          "สวัสดีจ้า",
          "สวัสดีตอนเช้า",
          "สวัสดีตอนบ่าย",
          "สวัสดีตอนเย็น",
          "อันยอง"
        ],
        "responses": [
          "สวัสดีจ้า! มีอะไรให้ช่วยไหม?",
          "สวัสดี! มีอะไรให้ช่วยไหม?"
        ]
      },
      {
        "tag": "ขอบคุณ",
        "patterns": [
            "ขอบคุณ",
            "ขอบคุณมาก",
            "ขอบใจ",
            "ขอบคุณจริง ๆ",
            "ขอบคุณจากใจ"
        ],
        "responses": [
            "ยินดีครับ",
            "ครับผมมม"
        ]
    },{
        "tag": "course_inquiry",
        "patterns": [
            "มีรายวิชาอะไรบ้าง",
            "รายวิชาที่เปิดสอนมีอะไรบ้าง",
            "ขอรายชื่อรายวิชาทั้งหมด",
            "รายวิชาที่น่าสนใจมีอะไรบ้าง",
            "สามารถเลือกเรียนรายวิชาอะไรได้บ้าง"
        ],
        "responses": [
            "คุณสามารถดูรายชื่อคอร์สทั้งหมดได้ที่หน้า 'รายวิชา' ตามลิ้งค์นี้ https://eds.kmutt.ac.th/curriculum/courses-offered/",
            "เรามีรายวิชามากมายให้เลือกลง คุณสามารถดูรายละเอียดเพิ่มเติมได้ที่ https://eds.kmutt.ac.th/curriculum/courses-offered/"
        ]
    },
    {
        "tag": "course_details",
        "patterns": [
            "รายละเอียดของรายวิชา",
            "ขอข้อมูลเพิ่มเติมเกี่ยวกับรายวิชา",
            "วิชา เรียนอะไรบ้าง",
            "มีรายละเอียดของรายวิชาไหม",
            "เนื้อหาของรายวิชานี้เป็นอย่างไร"
        ],
        "responses": [
            "สำหรับรายละเอียดของรายวิชา คุณสามารถดูที่หน้า Syllabus",
            "คุณสามารถดูข้อมูลเพิ่มเติมเกี่ยวกับรายวิชาที่สนใจได้ที่หน้า Syllabus",
            "คุณสามารถดูรายละเอียดของรายวิชาทั้งหมดได้ที่หน้า Syllabus  "
        ]
    },
    {
        "tag": "contact",
        "patterns": [
            "ติดต่อเรา",
            "ขอข้อมูลการติดต่อ",
            "ติดต่อฝ่ายสนับสนุน",
            "ต้องการความช่วยเหลือ ติดต่อที่ไหน",
            "ช่องทางการติดต่อมหาลัย"
        ],
        "responses": [
            "คุณสามารถติดต่อเราผ่านทางอีเมล regist@kmutt.ac.th",
            "คุณสามารถติดต่อฝ่ายสนับสนุนได้ที่อีเมล regist@kmutt.ac.th",
            "หากต้องการความช่วยเหลือ สามารถติดต่อเราได้ที่เฟซบุ๊ค 'สำนักงานทะเบียนนักศึกษา มจธ.' "
        ]
    },
    {
      "tag": "กีฬาฟุตบอล",
      "patterns": [
        "เล่นบอลที่ไหนบ้างในมอ?",
        "สนามฟุตบอลอยู่ที่ไหน?",
        "เวลาเล่นบอลคือเมื่อไหร่?"
      ],
      "responses": [
        "สนามฟุตบอลของมหาวิทยาลัยอยู่ที่หลังโรงยิมค่ะ คุณสามารถเล่นได้ทุกวันในช่วงเย็นตั้งแต่ 17:00 น. ถึง 19:00 น.",
        "สนามฟุตบอลหลักอยู่ใกล้หอพักนักศึกษา เปิดให้ใช้บริการตั้งแต่ 16:00 น. ถึง 20:00 น."
      ]
    },
    {
      "tag": "ฟิตเนสเวลาเปิด",
      "patterns": [
        "ฟิตเนสเปิดเวลาไหนบ้าง?",
        "ฟิตเนสเปิดกี่โมง?",
        "เวลาทำการของฟิตเนสคืออะไร?"
      ],
      "responses": [
        "ฟิตเนสของมหาวิทยาลัยเปิดให้บริการทุกวัน ตั้งแต่ 5:00 น. ถึง 22:00 น."
      ]
    },
    {
      "tag": "อุปกรณ์ฟิตเนส",
      "patterns": [
        "ที่ฟิตเนสมีอุปกรณ์อะไรให้ใช้บ้าง?",
        "ฟิตเนสมีเครื่องออกกำลังกายอะไรบ้าง?",
        "อุปกรณ์ในฟิตเนสมีอะไรบ้าง?"
      ],
      "responses": [
        "ฟิตเนสมีอุปกรณ์หลากหลาย เช่น ลู่วิ่ง เครื่องยกน้ำหนัก และเครื่องออกกำลังกายอื่นๆ"
      ]
    },
    {
      "tag": "สมัครสมาชิกฟิตเนส",
      "patterns": [
        "ต้องสมัครสมาชิกฟิตเนสยังไง?",
        "สมัครสมาชิกฟิตเนสทำได้อย่างไร?",
        "มีขั้นตอนการสมัครสมาชิกฟิตเนสอย่างไร?"
      ],
      "responses": [
        "สามารถสมัครสมาชิกฟิตเนสได้ที่หน้าเว็บไซต์ของมหาวิทยาลัย หรือที่เคาน์เตอร์ฟิตเนสโดยตรง"
      ]
    },
    {
      "tag": "สถานที่วิ่ง",
      "patterns": [
        "ที่ไหนวิ่งได้บ้างในมอ?",
        "สามารถวิ่งได้ที่ไหนบ้างในมอ?",
        "ในมอมีที่ให้วิ่งไหม?"
      ],
      "responses": [
        "ในมหาวิทยาลัยมีหลายเส้นทางวิ่ง เช่น รอบสนามกีฬา และรอบอาคารเรียน"
      ]
    },
    {
      "tag": "เวลาที่เหมาะสมสำหรับการวิ่ง",
      "patterns": [
        "วิ่งช่วงเวลาไหนดี?",
        "เวลาวิ่งที่เหมาะสมคือเวลาไหน?",
        "ควรวิ่งเวลาไหนดีที่สุด?"
      ],
      "responses": [
        "ช่วงเวลาที่แนะนำสำหรับการวิ่งคือช่วงเช้า 5:00 น. ถึง 8:00 น. และช่วงเย็น 17:00 น. ถึง 20:00 น."
      ]
    },
    {
      "tag": "กีฬาบาสเกตบอล",
      "patterns": [
        "เล่นบาสได้ที่ไหนในมอ?",
        "สนามบาสอยู่ที่ไหน?",
        "เวลาเล่นบาสคือเมื่อไหร่?"
      ],
      "responses": [
        "สนามบาสเกตบอลของมหาวิทยาลัยตั้งอยู่ที่อาคารกีฬาใกล้กับโรงอาหาร เปิดให้บริการตั้งแต่ 7:00 น. ถึง 21:00 น.",
        "คุณสามารถเล่นบาสเกตบอลได้ที่สนามข้างโรงยิมใหญ่ ซึ่งเปิดให้ใช้บริการตั้งแต่ 6:00 น. ถึง 22:00 น."
      ]
    },{
      "tag": "การหายใจลึก",
      "patterns": [
          "ฉันรู้สึกเครียด",
          "ฉันควรทำอย่างไรเมื่อเครียด",
          "มีวิธีการลดความเครียดไหม"
      ],
      "responses": [
          "การหายใจลึก ๆ ช่วยลดความเครียดได้ครับ ลองนั่งในที่เงียบ ๆ แล้วหายใจเข้าลึก ๆ นับ 1-5 แล้วหายใจออกช้า ๆ ทำซ้ำหลาย ๆ ครั้ง",
          "เมื่อรู้สึกเครียด ลองหายใจเข้าลึก ๆ แล้วหายใจออกช้า ๆ ทำซ้ำสัก 5-10 นาที จะช่วยให้คุณรู้สึกผ่อนคลายขึ้นครับ",
          "วิธีการหนึ่งที่ช่วยลดความเครียดได้คือการหายใจลึก ๆ นั่งในที่สบาย ๆ แล้วหายใจเข้าลึก ๆ นับ 1-5 แล้วหายใจออกช้า ๆ ทำซ้ำหลาย ๆ ครั้ง"
      ]
    },
    {
        "tag": "การทำสมาธิ",
        "patterns": [
            "การทำสมาธิช่วยลดความเครียดได้ไหม",
            "ฉันควรทำสมาธิอย่างไร",
            "มีวิธีการทำสมาธิแนะนำไหม"
        ],
        "responses": [
            "การทำสมาธิเป็นวิธีที่ดีในการลดความเครียด ลองหาที่เงียบ ๆ นั่งสบาย ๆ ปิดตา และมุ่งความสนใจไปที่การหายใจของคุณ ทำอย่างนี้ 10-15 นาที",
            "คุณสามารถเริ่มทำสมาธิได้ง่าย ๆ โดยการนั่งในที่เงียบ ๆ หลับตา และมุ่งความสนใจไปที่การหายใจ ลองทำอย่างนี้สัก 10 นาทีทุกวัน",
            "ลองทำสมาธิทุกวันเพื่อช่วยลดความเครียด นั่งในที่เงียบ ๆ หลับตา และมุ่งความสนใจไปที่การหายใจของคุณ ทำสัก 10-15 นาที"
        ]
    },
    {
        "tag": "การออกกำลังกาย",
        "patterns": [
            "การออกกำลังกายช่วยลดความเครียดได้ไหม",
            "ฉันควรออกกำลังกายแบบไหนดี",
            "มีการออกกำลังกายแนะนำไหม"
        ],
        "responses": [
            "การออกกำลังกายช่วยลดความเครียดได้ ลองออกกำลังกายที่คุณชอบ เช่น การวิ่ง, โยคะ, หรือการเดินเล่นสัก 30 นาที",
            "คุณสามารถออกกำลังกายเพื่อช่วยลดความเครียด ลองวิ่ง, ปั่นจักรยาน, หรือเล่นกีฬาที่คุณชื่นชอบ",
            "การออกกำลังกายเป็นวิธีที่ดีในการลดความเครียด ลองทำโยคะ, วิ่ง, หรือการเดินเล่นสัก 30 นาที"
        ]
    },
    {
        "tag": "การฟังเพลง",
        "patterns": [
            "การฟังเพลงช่วยลดความเครียดได้ไหม",
            "ฉันควรฟังเพลงแบบไหนดีเมื่อเครียด",
            "มีเพลงแนะนำไหม"
        ],
        "responses": [
            "การฟังเพลงที่คุณชอบสามารถช่วยลดความเครียดได้ ลองฟังเพลงที่มีจังหวะช้า ๆ หรือเพลงที่คุณรู้สึกผ่อนคลาย",
            "ลองฟังเพลงที่มีจังหวะช้า ๆ หรือเพลงที่คุณชอบเมื่อรู้สึกเครียด จะช่วยให้คุณรู้สึกผ่อนคลายขึ้น",
            "เพลงที่มีจังหวะช้า ๆ หรือเพลงที่คุณรู้สึกผ่อนคลายสามารถช่วยลดความเครียดได้ ลองฟังเพลงแนวคลาสสิกหรือแนวธรรมชาติ"
        ]
    },
    {
        "tag": "การพักผ่อน",
        "patterns": [
            "ฉันรู้สึกเหนื่อยและเครียด",
            "ฉันควรทำอย่างไรเมื่อรู้สึกเหนื่อย",
            "มีวิธีการพักผ่อนแนะนำไหม"
        ],
        "responses": [
            "การพักผ่อนอย่างเพียงพอเป็นสิ่งสำคัญ ลองพักสายตาและนอนหลับให้เพียงพอ จะช่วยลดความเครียดได้",
            "เมื่อรู้สึกเหนื่อยและเครียด ลองนอนพักหรือหลับตาและพักสายตาสัก 10-15 นาที",
            "การพักผ่อนเป็นวิธีที่ดีในการลดความเครียด ลองนอนหลับให้เพียงพอหรือหาที่เงียบ ๆ และพักผ่อนสักครู่"
        ]
    },
    {
        "tag": "การพูดคุย",
        "patterns": [
            "ฉันควรทำอย่างไรเมื่อรู้สึกเครียด",
            "การพูดคุยช่วยลดความเครียดได้ไหม",
            "ฉันควรพูดคุยกับใครดีเมื่อรู้สึกเครียด"
        ],
        "responses": [
            "การพูดคุยกับเพื่อนหรือคนในครอบครัวสามารถช่วยลดความเครียดได้ ลองหาคนที่คุณไว้ใจและพูดคุยเกี่ยวกับความรู้สึกของคุณ",
            "เมื่อรู้สึกเครียด ลองพูดคุยกับเพื่อนหรือคนในครอบครัวที่คุณไว้ใจ จะช่วยให้คุณรู้สึกดีขึ้น",
            "การพูดคุยกับคนที่คุณไว้ใจสามารถช่วยลดความเครียดได้ ลองหาคนที่คุณสนิทและพูดคุยเกี่ยวกับความรู้สึกของคุณ"
        ]
    },{
      "tag": "จัดลำดับการทำการบ้าน",
      "patterns": [
          "ฉันควรจัดการการบ้านอย่างไร",
          "มีวิธีการจัดลำดับการทำการบ้านไหม",
          "ฉันควรทำการบ้านอย่างไรให้เสร็จเร็ว"
      ],
      "responses": [
          "คุณควรเริ่มจากการจดลิสต์การบ้านทั้งหมดและจัดลำดับตามความสำคัญและวันกำหนดส่ง",
          "ลองทำการบ้านที่ยากหรือใช้เวลามากที่สุดก่อน จากนั้นทำการบ้านที่ง่ายและใช้เวลาน้อยกว่า",
          "การวางแผนและแบ่งเวลาสำหรับแต่ละวิชาจะช่วยให้คุณทำการบ้านเสร็จตามกำหนด"
      ]
  },
  {
      "tag": "การจัดลำดับตามความสำคัญ",
      "patterns": [
          "การบ้านวิชาไหนควรทำก่อน",
          "ฉันควรทำการบ้านวิชาอะไรก่อนดี",
          "การบ้านเยอะมาก ฉันควรเริ่มตรงไหน"
      ],
      "responses": [
          "ลองเริ่มจากการบ้านที่สำคัญที่สุดหรือการบ้านที่มีกำหนดส่งใกล้ที่สุดก่อน",
          "การบ้านที่ยากที่สุดหรือใช้เวลามากที่สุดควรทำก่อนเพราะต้องใช้สมาธิและพลังงานมาก",
          "หากมีการบ้านที่ต้องการความช่วยเหลือหรือคำแนะนำจากครูหรือเพื่อน ลองเริ่มจากวิชานั้นก่อน"
      ]
  },
  {
      "tag": "การจัดลำดับตามเวลา",
      "patterns": [
          "ฉันควรแบ่งเวลาทำการบ้านอย่างไร",
          "การบ้านเยอะมาก ฉันควรจัดการเวลายังไงดี",
          "ฉันควรทำการบ้านแต่ละวิชาใช้เวลาเท่าไหร่"
      ],
      "responses": [
          "ลองแบ่งเวลาทำการบ้านในแต่ละวิชาอย่างชัดเจน เช่น วิชาละ 1 ชั่วโมง จากนั้นพักสั้น ๆ แล้วทำต่อ",
          "การแบ่งเวลาทำการบ้านแต่ละวิชาเป็นช่วง ๆ เช่น 30-45 นาที แล้วพัก 5-10 นาที จะช่วยให้คุณไม่เหนื่อยเกินไป",
          "คุณสามารถใช้เทคนิค Pomodoro แบ่งเวลาเป็นช่วงสั้น ๆ เช่น 25 นาทีทำการบ้าน 5 นาทีพัก ทำซ้ำหลาย ๆ รอบ"
      ]
  },
  {
      "tag": "การจัดลำดับตามความยาก",
      "patterns": [
          "การบ้านเยอะมาก ฉันควรเริ่มจากอะไร",
          "ควรทำการบ้านยากหรือง่ายก่อนดี",
          "มีการบ้านหลายวิชา ฉันควรทำอะไรก่อน"
      ],
      "responses": [
          "ควรเริ่มจากการบ้านที่ยากหรือใช้เวลามากที่สุดก่อน เพื่อให้คุณสามารถใช้สมาธิและพลังงานเต็มที่",
          "การบ้านที่ง่ายหรือใช้เวลาน้อยควรทำหลังจากการบ้านที่ยากเสร็จแล้ว จะช่วยให้คุณรู้สึกสบายและไม่เครียดเกินไป",
          "ลองจัดลำดับการบ้านตามความยาก เริ่มจากยากไปง่าย เพื่อให้คุณสามารถบริหารเวลาได้ดียิ่งขึ้น"
      ]
  },{
    "tag": "การพูดคุย",
    "patterns": [
        "ฉันควรทำอย่างไรเมื่อรู้สึกเครียด",
        "การพูดคุยช่วยลดความเครียดได้ไหม",
        "ฉันควรพูดคุยกับใครดีเมื่อรู้สึกเครียด"
    ],
    "responses": [
        "การพูดคุยกับเพื่อนหรือคนในครอบครัวสามารถช่วยลดความเครียดได้ ลองหาคนที่คุณไว้ใจและพูดคุยเกี่ยวกับความรู้สึกของคุณ",
        "เมื่อรู้สึกเครียด ลองพูดคุยกับเพื่อนหรือคนในครอบครัวที่คุณไว้ใจ จะช่วยให้คุณรู้สึกดีขึ้น",
        "การพูดคุยกับคนที่คุณไว้ใจสามารถช่วยลดความเครียดได้ ลองหาคนที่คุณสนิทและพูดคุยเกี่ยวกับความรู้สึกของคุณ"
    ]
},{
  "tag": "ฟอรั่ม",
  "patterns": [
      "ถ้าฉันมีคำถามกับเนื้อหาที่เรียนจะทำยังไง?",
      "ถ้าฉันมีข้อสงสัยกับอาจารย์จะทำยังไง?"
  ],
  "responses": [
      "คุณสามารถเข้าหน้า Q&A Board เพื่อโพสต์คำถามลงบนบอร์ดได้เลย"
  ]
},{
  "tag": "การบ้าน",
  "patterns": [
      "ฉันจะส่งงานได้ยังไง?",
      "ฉันจะส่งการบ้านได้ยังไง?"
  ],
  "responses": [
      "ทำได้โดยเข้าไปที่หน้า Assignment และเลือกหัวข้องานจากนั้นอัพโหลดไฟล์งานได้เลย"
  ]
}
    ]
  }